<?php

return [

    /*
    |--------------------------------------------------------------------------
    | バリデーションメッセージ（日本語）
    |--------------------------------------------------------------------------
    */

    'required' => ':attributeは必須です。',
    'date'     => ':attributeの形式が正しくありません。',
    'email'    => ':attributeの形式が正しくありません。',
    'image'    => ':attributeは画像ファイルを指定してください。',
    'integer'  => ':attributeは数値で指定してください。',
    'between'  => [
        'numeric' => ':attributeは:min〜:maxの範囲で指定してください。',
    ],
    'max' => [
        'string' => ':attributeは:max文字以内で入力してください。',
    ],

    /*
    |--------------------------------------------------------------------------
    | 属性名の日本語化（管理画面用）
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'title'        => 'タイトル',
        'body'         => '本文',
        'published_at' => '公開日',
        'image'        => '画像',
        'date' => '休業日',
        'type' => '種別',
        'note' => '備考',
    ],
];
